[{"id":"_5xbjyhpfl","author":"Brenda Stolyar","title":"Why LG is saying goodbye to its smartphone business","blogtext":"LG is closing up shop on its mobile phone business, the company announced Sunday. \r\n\r\nThe decision \"will enable the company to focus resources in growth areas such as electric vehicle components, connected devices, smart homes, robotics, artificial intelligence and business-to-business solutions, as well as platforms and services,\" LG said in an official statement.\r\n\r\nThe news doesn't come as much of a shock — last week, The Korea Times reported the confirmation would be announced on April 5. The outlet's sources claim the choice was made after the company failed to sell its mobile division. \r\n\r\nThe company did at least attempt to innovate with its smartphone lineup this past year, specifically with its Explorer Project. This was LG's bid to throw unusual smartphone concepts at the wall to see what would stick.\r\n\r\nOnly two phones came out of that project: the minimalist LG Velvet and the dual-screen LG Wing. At this year's CES, the company also teased a rollable Android phone — which is what it sounds like, a phone with a display that literally rolls up. But a report later claimed the project was put on hold. Now we can see more clearly why that was.\r\n\r\nJust because it won't be producing handsets doesn't mean LG is completely stepping out of the smartphone world, however. The company said it will use its mobile expertise to help develop 6G wireless communications, among other smartphone-related technologies. \r\n\r\nRegardless, it's not too late to snag an LG phone; the company said that its current lineup will still be available for sale. Meanwhile, customers who already own an LG device will continue to receive support and software updates for a \"period of time which will vary by region.\"\r\n\r\nIts smartphone business won't officially shut down until July 31 – and, according to LG, there may be inventory of some of its existing devices even after that.","date":"Tue Apr 06 2021 16:27","image":"_rhigyrnan.jpg"},{"id":"_j00yrz274","author":"Adam Rosenberg","title":"Apple Arcade's big update is a golden opportunity to rescue lost games","blogtext":"Apple Arcade's biggest update so far is here and it's exciting in terms of both what it delivers and what the latest changes could deliver in the future.\r\n\r\nFirst, the news. On Friday, the Apple Arcade subscription service — which gives iOS users unfettered access to a library of games for $5 per month — added more than 30 games, including standouts like Fantasian (from the creator of the Final Fantasy series) and a new spin on The Oregon Trail.\r\n\r\nThat wasn't all, though. In a twist, Apple also introduced two new sections for the Arcade catalog, one for \"Timeless Classics\" and the other for \"App Store Greats.\" These two buckets bring an additional layer to Arcade, which launched with the pitch that subscribers would get access to games that couldn't be played on any other mobile platform.\r\n\r\nThe expansion, however, creates the space for Apple to add older titles to the mix as well. It's off to a promising start too, with the two new categories together delivering popular games like Threes!, Mini Metro, Really Bad Chess, and SpellTower. But I see a missed opportunity here, too; or better, an opportunity in the making.\r\n\r\nBack in 2017, Apple killed support for 32-bit iOS apps with the launch of iOS 11. In a single update, thousands and thousands of apps were suddenly no longer supported. Even with plenty of lead time given to app developers and the public alike so everyone could prepare, not every app made the leap.\r\n\r\nThat included a huge number of games, many of which would comfortably fit under Apple's \"App Store Greats\" umbrella. Personally, I still hang on to a pre-iOS 11 iPhone because my beloved Infocom collection, The Lost Treasures of Infocom, didn't get a 64-bit update from IP owner Activision. Every year or so I hop on Twitter and reach out to the Activision PR crew to throw a temper tantrum about the effective erasure of an important piece of gaming history.\r\n\r\nBut I digress. The point is, there are some real forgotten gems in Apple's defunct 32-bit game library, games that lots of people have fond memories of playing. We've seen some get re-released over time, but nowhere close to all of them. The subscription service GameClub exists in the first place to give people a way to play at least some of the lost games.\r\n\r\nWhat's stopping Apple, then, from putting some of its resources toward reviving the lost gems of the pre-2017 App Store? As much as a pre-Arcade Apple kept video games at arm's length, we're still talking about the first major gaming platform in the mobile. The first iPhone didn't only popularize smartphones; it was also a hit for gaming.\r\n\r\nI'm talking about foundational classics like Edge and Spider: The Secret of Bryce Manor. Or Shadowgun. Space Invaders Infinity Gene. Peggle Classic. Anyone who owned a pre-iOS 11 Apple device probably has at least one or two favorites that aren't around anymore.\r\n\r\nI know game development is no easy process, and updating any of these (or others) for 64-bit support might be more costly (or challenging for other reasons) than it's worth. But Apple's latest Arcade update opened the door to a big piece of gaming history that was so quickly forgotten. Here's hoping the company sees the opportunity and does something about it.\r\n\r\n\r\n","date":"Tue Apr 06 2021 16:39","image":"_8trqnuu7f.jpg"},{"id":"_as4ecqasp","author":"Ashley Keegan","title":"Weebly vs. Squarespace: How these top website builders really stack up against each other","blogtext":"Setting up a website for your business, blog, or personal portfolio can open up a ton of doors for you, both professionally and personally. When done properly, it can get your skills, talents, and goods in front of the eyes of those who need to see them most. That's awesome! But it's also a lot of pressure to hang on your website, and that can make things a little stressful (to say the least) when it comes to picking the perfect website builder for your needs.\r\n\r\nWhile it can be tough to pick from the wide array of site builders out there, you're already off to a great start by landing here, since Squarespace and Weebly are two of the best website builders to ever do it. However, where Squarespace is a bit more stylish and — dare we say — flashy, Weebly is a bit more understated, despite what its somewhat cutesy name might suggest. They're quite similar overall, but they do differ in key ways that may make one more suited to your style or your particular website needs, whether it's for drumming up interest in your small business, showcasing a portfolio or other creative freelance skill, or getting your thoughts and blogs out to a wider audience.\r\n\r\nBut before we dig into how they differ, let's take a look at how much Squarespace and Weebly actually have in common:\r\n\r\nBoth provide their own easy-to-use website builder to make site customization seamless and easy, even for beginners with zero background in coding.\r\n\r\nBoth allow users to create websites that look great on mobile devices without any additional tweaking, and both provide incredible design flexibility, allowing users to change their templates at any time without losing information or having to rebuild from scratch. (Two key things we unfortunately cannot say about these platforms' main competitor, Wix.)\r\n\r\nBoth also offer great blogging tools by default, as well as great ecommerce features to cater to all types of websites.\r\n\r\nSquarespace and Weebly are on par with each other in terms of similar search engine optimization (SEO) tools to help land your site higher in search results, including easy editing of page title, description, and URL, as well as easy-to-understand guides to walk you through all the SEO stuff you need to know.\r\n\r\nBoth website builders allow you to easily link a custom domain from a third-party provider to your site. Otherwise, you can purchase your domain directly from Squarespace or Weebly, and both will give you your first year for free.\r\n\r\nPoint is, either one will get you set up with an attractive, professional-looking, and well-functioning website. However, each site builder differs in some key ways, so let's dig into the race of Squarespace versus Weebly to see where one or the other pulls ahead depending on your individual needs or preferences.","date":"Tue Apr 06 2021 16:58","image":"_tvzdh9ru8.jpg"}]